results/sc_mem_2md_md/tsung_test.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="edxucla-mc-1-1016821226.us-west-2.elb.amazonaws.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="1.5" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="60" unit="second">
     <users arrivalrate="4" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="60" unit="second">
     <users arrivalrate="6" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="60" unit="second">
     <users arrivalrate="10" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="7" duration="60" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="search-user" probability="100" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <for from="1" to="3" incr="1" var="counter">
        <thinktime value="2" random="true"/>
        <setdynvars sourcetype="random_number" start="1" end="1000">
          <var name="course_number"/>
        </setdynvars>

        <request subst="true">
          <http url="/search?type=Course&amp;input=ge%%_course_number%%" version="1.1" method="GET"/>
        </request>
      </for>
    </session>
  </sessions>
</tsung>